package kr.co.demo;

public class Exam06_1 {

	public static void main(String[] args) {
		/*
		 * 1 부터 시작하여 10 까지 총 10번 반복하는 반복문을 작성하세요.
		 * 출력 메시지는 다음의 형식으로 합니다.
		 * 
		 * 출력 형식
		 * 		총 10번 반복 중 n번 반복
		 * 
		 * n이 1 ~ 10까지 1씩 증가되어서 출력돼야 함
		 */
		
		
		/* 
		 * 총 15번 반복하는 반복문을 사용하고 3부터 시작하여 45까지 3의 배수에
		 * 해당하는 값만 출력하는 코드를 작성하시오.
		 */
		
		
		/*
		 * 7부터 시작하여 7의 배수에 해당하는 값을 출력할 때 150 이전에 출력되는
		 * 7의 배수 값과 총 반복 횟수를 출력하시오.
		 */
		
		
		/*
		 * 사용자 입력을 활용하여 사용자가 입력한 정수값만큼 반복을 수행하는 반복문을
		 * 작성하시오. 
		 * (사용자 입력값이 0 이하인 경우 '1 이상의 값을 입력하세요' 라는 메시지를
		 * 출력하고 종료한다.)
		 */
		
		
		/*
		 * 사용자 입력을 활용하여 사용자가 입력한 2 개의 정수값 n, m을 n ~ m까지의
		 * 반복 또는 m ~ n까지의 반복을 수행하는 코드를 작성하시오.
		 */
		
		
		/* 사용자 입력과 if, for 를 활용하여 사용자로부터 정수값을 입력 받았을 때
		 * 1 ~ 45 사이의 값이 아니면 다시 입력을 받아 1 ~ 45 사이의 값이 저장될
		 * 수 있게 한다. 
		 * (단, 3번의 입력 기회만 부여하고 3번의 기회를 넘기면 0값이 저장되게 한다.)
		 */

	}

}
